import { questionBuilder } from "./question-builder";

export const questions = questionBuilder()
  .class(`ibtidaai2`)
  .new(`SEEROH`, "full")
  .csv(
    `١,   هذا . . . . . . . . الذي نزّل على موسى.,   ا; إنجيل,      ب; الناموس,      ج; جبريل
٢,   إنك لتَصلُ . . . . . . . .,   ا; الكلّ,      ب; المعدوم,      ج; الرّحم
٣,   وتَكسبُ . . . . . . .، وتَقري . . . . . . . . ., ا; المعدوم، الرّحم,      ب; الكلّ؛ المعدوم,      ج; المعدوم؛ الضّيف
٤,   أول من أسلم من الرجال . . . .  . . .,  ا; عمرُ بن الخطاب,      ب; عليُّ,      ج; أبو بكرٍ الصديق
٥,   اسم أبو بكر . . . . . . . . . .,  ا; عبد الرحمن بن صخر,      ب; عبد الله بن عباس,      ج; عبد الله بن أبي قَحافة
٦,   أول من أسلم من النساء . . . . . . . .  . .,  ا; عائشةُ,      ب; أم سلمةَ,      ج; خديجةُ
٧,   قال عليُّ نفسُه. "أنا أول من . . . . . . . . . مع الرسول - صلى الله عليه وسلم -.,  ا; حجّ,     ب; صام,     ج; صلّى
٨,   "فإني . . . . . . . . . . لكم بين يدي عذابٍ شديد",   ا; قرين,      ب;. نذير,     ج; زميل
٩,   فأما رسول الله صلى الله عليه وسلم فمَنَعَه الله  بـ. . . . . . . . .,    ا; أبي بكر,    ب; جدّه,     ج; عمِّه
١٠, من القائل "أما والله حتى تموتَ، ثم تُبعثَ فلا",  ا; أنس بن مالك,       ب; عروة بن الزبير,      ج; خبّاب بن الأرتّ

اختر واحدا من السؤال الأول والثاني ثمّ اختر أربعةً شِئْت من الباقين
١,   املأ الفِراغات
_إنّ بِأرض . . . . . . . . . . . ملِكا لا يُظلم . . . . . . . . . عنده فالحَقوا . . . . . . . . . . . . . حتى يجعلَ الله لكم . . . . . . . . . . . . . . . .  مما أنتم فيه.
 _(اليمنُ، الحبشةَ، فَرْدُ، شَخْصٌ، أَحد، ببِلاده، بقريتِه، مِسكينا، وَلَاحَةُ، حِكْمَةُ  وَرُشدًا، فَرْجًا وَمَخْرَجًا)
٢,   اشرح خمسةَ كلمات من الكلمات الآتية
     _ا. الرُّؤْيا  ب. الجَهدُ  ج. فغَطاني د. وتَكسِب المعدوم هـ. جَذْعا و.عشيرتَكَ ز. تبّت ح. نادينا ط. الكهنة ي. ذو كبدٍ
٣,   اكتب ستة أسماء الذين أظهروا إسلامهم.
٤,   من كان يدفّع عن أبي ذرّ لما أسلم؟
٥,   ماذا قال ضماد بعد ما سمع قول النبي صلى الله عليه وسلم؟
٦,   ما يُسلم على النبي - صلى الله عليه وسلم - قبل النُّبوة؟ وأين؟
٧,   ماذا قال النبي - صلى الله عليه وسلم - في أول مرة إذ قال له جبريل "اقرأ" وماذا قال جبريل في الأخير؟
٨,   ما جواب قوم النبي - صلى الله عليه وسلم- إذ قال: لو أخبرتكم أن خيلا بالوادي تريد أن تُغير عليكم ؟
٩,   ما الآية التي نزلت فصعد النبي صلى الله عليه وسلم الصّفا فجعل ينادي؟
`,
  )
  .save().classQuestions;
