export const studentsDataUpdated = `
📃 الأول التمهيد ا

إبراهيم.عبد القادر
أنس إبراهيم
أنس رشيد
إسماعيل محمد. ق. ر٣٠٠٠
شريف.عبد الواسع
صقي الله.عبد الغني. ق.
عبد الباسط.إسماعيل. ر٣٠٠٠
عبد الحق.عبد الحميد
عبد الحليم.يحيى
عبد الرحمان.محمد. ر٣٠٠٠
عبد السلام.دنميرمو. ر٣٠٠٠
عبد القادر.علي. ر٣٠٠٠
عبد القادر.موسى
عبد الله.لقمان
عبد الله.عبد الله. ر٢٠٠٠
عبد الله.يوسف.ألاتى. ق*
عبد الملك.عبد اللطيف
عثمان.أمين الله
عمر مصطفى
قاسم حسن
محمد دنميرومو
محمد.سراج الدين. ق. ر٣٠٠٠
محمد.عبد الرحمان. ر٣٠٠٠
محمد الأول.عبد الغني. ر٣٠٠٠
محمد طة.إسحاق. ق. ر٣٠٠٠.
محمود مييكي
مختار إيشولى. ر٣٠٠٠
نسيف.أبو بكر
- - - - - - - - - - - -
بلقيس.كمال الدين.
توفيقة يوسف. ق
حبيبة مسعود. ق
حليمة مييكي
حديزة.عبد الواسع
حنيفة سليمان. ر٣٠٠٠
خديجة إبراهيم. ر٣٠٠٠
راضية إسماعيل
راضية.عبد الواسع
رحيمة.تاج الدين
زينة أحمد. ر٣٠٠٠
مريم دنميرومو
مزيدة.أمين الله. ر٣٠٠٠
مؤمنة.عبد الكبير. ر٣٠٠٠
مطمئنة أولاييوولا. ر٣٠٠٠
منيرة لقمان
عائشة.أبو بكر
عبيدة.سراج الدين. ر٣٠٠٠
فاطمة.أحمد
فاطمة دنميرمو. ر٢٠٠٠
فاطمة لقمان

📃 الأول التمهيد ب
أبو بكر.عبد الرحمان.
أحمد.علي. ر٣٠٠٠
أحمد غاتا
إسحاق إسحاق.
حبيب الله.محمد
سلطان غاتا.
صالح.عبد الله. ر٢٠٠٠
عبد الرحمان.يوسف
عبد السلام.عبد الحميد
عبد الله.عبد القادر
عبد الله.غاتا
عبد الله.لقمان. ر٣٠٠٠
عبد الله.إسحاق.ميماسى
عبد القادر.عبد الرحمان
عبد القادر.مصطفى
عيسى عيسى. م.
مجتبى أحمد. ر٣٠٠٠
مصطفى.عبد القادر

حكيمة إبراهيم
رحمت الله.عبد الواسع
زينة أحمد
صبيرة.عثمان
عائشة.أحمد.إيشولى
عائشة.عبد الله. ر٢٠٠٠
عليّة إبراهيم. ر٣٠٠٠

📃 الأول التمهيد ج

إبراهيم آدم. ر٣٠٠٠
آدم إلياس. ق:م. رس٣٠٠٠. ر٢٠٠٠
أبو بكر.إبراهيم. ر٣٠٠٠
زيد أبندواكي. رس١٠٠٠. *
حسن مسعود. رس٣٠٠٠
حسين مسعود. رس٣٠٠٠
عبد الرحمان.كمال الدين
عبد القادر.جامع. ر٣٠٠٠
عبد الله.إيشولى. ر٣٠٠٠
عثمان.محمد
يوسف آدم

بلقيس إبراهيم
حنيفة عيسى. ر٣٠٠٠
حليمة عثمان
زينب.عبد القادر
شلامة.عبد السلام. ر٣٠٠٠. ق:ح
عائشة.يوسف.إبراهيم. م.
فاطمة إدريس. م.
مريم.عبد الواسع. ق:ح
هاجر أمودى.
يسرى.لقمان. ر٣٠٠٠

📃 الأول التمهيد د

أحمد أجنجي.
أنس أولاييولى. ر٣٠٠٠
أويس أبندواكي. رس٣٠٠٠. *
عبد الخالق.معروف. ر٣٠٠٠
عبد الرحمان.أحمد. ر٣٠٠٠
عبد القادر.ميماسى. ر٣٠٠٠
عبد المقسط.إسماعيل. ر٣٠٠٠
. . . . . . . . . . . . . . . . . . . . . . . . .

📃 الثاني التمهيد

إبراهيم.كمال الدين. ق:تج
سلمان أونييكون. ق:تج
نور الدين.إسماعيل. ق:تج
عبد الله.عبد الرحمان. ق:تج
عثمان.عبد القادر. ر٣٠٠٠.
يوسف.عبد الكريم. ق:تج
. . . . . . . . . . .

بلقيس أحمد. ق:ح. ر٣٠٠٠
بلقيس أونيكون. ق:ح
حواء محمد. ق:ح
رحمة إسماعيل. ق:تج. ر٣٠٠٠
رحمة لقمان. ق:ح
فاطمة إبراهيم. ق:ح
مريم إيشولى. ق:ح
هاجر دنميرومو. ق:تج

📃 الأول الإبتدائي

إبراهيم.أبو بكر. ق:ج
إبراهيم أحمد. ق:م. ر٢٠٠٠.
إبراهيم.عبد القادر. ق:م
أنس عثمان. ق:ج
بلال أبندواكي. رس٣٠٠٠. *
جلال الدين.يوسف. *
حذيفة بشير. ق. ق:م
حسن ميماسى. ر٣٠٠٠. ق:م
حسين ميماسى. ر٣٠٠٠. ق:م
خليفة الصالحين.عبد الكريم. ق. ق:ج
صالح بشير. ق. ق:م.
طه عيسى. ق:م. م.
عبد الباسط.مرتضى. ق:م.
عبد الجبار.إبراهيم. ق:م.
عبد الحميد.سعيد. ق:م.
عبد الرحمان.محمد الأول. ر٣٠٠٠. ق:م
عبد الرحمان سليمان. ق:ج. ر٣٠٠٠
عبد السلام.أمدى. ق:م
عبد السلام.أحمد. ق:ج. ر٢٠٠٠
عبد القادر.معروف. ق:م
عبد القيوم.عبد الغني. ق:م. ر٣٠٠٠
عبد الله.مصطفى. ق:م
عبد الملك.إسماعيل. ق:م. م.
عبد الملك.سليمان. ق:م.
عبد الملك.عبد الكبير. ر٣٠٠٠. ق:ج
عبد المتين. يحيى. ر٣٠٠٠. ق:ج
عبد الوكيل.يوسف. ق:م
عثمان سليمان. ق:م. ر٣٠٠٠
علي أحمد. ر٣٠٠٠. ق:م
غالب.عبد الكريم. ق. ق:م.
كمال الدين.يوسف. ق. ق:ج
محمد سليمان. ق:ج. ر٣٠٠٠
محمد عثمان. ق:م.
محمد ناصر.عبد القادر. ق:م.
منصور بللوا. ق:ج
مصطفى أحمد. ر٣٠٠٠. ق:م.
. . . . . . . . . . . . . . . . . . . . . . . .
أسماء جامع. م. ق:ح
توفيقة.عبد الأوّل. ق. ق:ح
حسنة عثمان. ق:ح
حسينة عثمان. ق:ح
حليمة.عبد الله. ق:أ
رقية حسن. ق:ح
ريحانة سليمان. ق:ح. ر٣٠٠٠
زينب بشير. ق
زينب يوسف. رس٣٠٠٠. ق:أ
سلامة قاسم. ق:أ
عائشة.عبد الأوّل. ق. ق:ح
عائشة.عبد القادر. ر٣٠٠٠. ق:أ
عائشة عيسى. ر٢٠٠٠. ق:أ
فاتحة.عبد المؤمن. ق*.
فاطمة.إسحق.ميماسى. ق:ح
فردوس أولاييوولى. ر٣٠٠٠. ق:أ
مريم. عبد القادر. ر٣٠٠٠. ق:أ
مريم.عبد الكبير. ر٣٠٠٠. ق:أ
مريم موسى. ر٣٠٠٠. ق:أ
ميمونة.عبد القادر. ق:ح
مؤمنة.أبو بكر. ق:أ.
نجيبة يوسف. ق. ق:أ.

📃 الثاني الإبتدائي

حمزة.محمد الأول. ر٣٠٠٠. ق:ج
ذو القرنين.غاتى. ق:ج
عبد الله.سليمان. ر٣٠٠٠. ق:ج
عبد العظيم.إسماعيل. ر٣٠٠٠. ق:ج
محمد يونس. م. ق:ج

أسماء جامع. ر٣٠٠٠
رحيمة أبندواكي. رس٣٠٠٠
رقيبة يحيى. ر٣٠٠٠
صفية.مصلح الدين. ر٣٠٠٠
فريدة إبراهيم. ر٣٠٠٠
مريم جمعة.
مريم سليمان. ر٣٠٠٠
. . . . . . . . . . . . . . . . . . . . . . . . . .

📃 الأول الإعدادي

إبراهيم إدريس
عبد الرحمان.عيسى. رس١٠٠٠
عبد الرحيم.عثمان
عبد الوهاب.إسحاق.
مصطفى سليمان

عائشة جمعة
عائشة عثمان
. . . . . . . . . . . . . . . . . . . . . . . . . .

📃 الثاني الإعدادي

آدم إدريس. م
عبد الحيّ.مصطفى. رس٣٠٠٠
عبد الله.إبراهيم. م
عبد السلام.عيسى. رس٣٠٠٠
محمد مصطفى. رس٣٠٠٠.

حليمة يوسف. م
مريم إبراهيم
مريم.سراج الدين
. . . . . . . . . . . . . . . . . . . . . . . . . `;
export const studentsData = `
📃 الأول التمهيد ا

أبو بكر.عبد الرحمان
إبراهيم.عبد القادر
أنس إبراهيم
أنس رشيد
إسماعيل محمد. ق. ر٣٠٠٠
خديجة
شريف.عبد الواسع
صقي الله.عبد الغني
عبد الباسط.إسماعيل
عبد الحق.عبد الحميد
عبد الحليم.يحيى
عبد الرحمان.محمد. ر٣٠٠٠
عبد السلام.دنميرمو. ر٣٠٠٠
عبد القادر.علي. ر٣٠٠٠
عبد القادر.موسى
عبد الله.لقمان
عبد الله.عبد الله
عبد الله.يوسف.ألاتى. ق*
عبد الملك.عبد اللطيف
عثمان.أمين الله
عمر مصطفى
قاسم حسن
محمد دنميرومو
محمد.سراج الدين. ق. ر٣٠٠٠
محمد.عبد الرحمان
محمد الأول.عبد الغني. ر٣٠٠٠
محمد طة.إسحاق. ق. ر٣٠٠٠.
محمد صالح.إبراهيم
محمود مييكي
مختار إيشولى
نسيف.أبو بكر
- - - - - - - - - - - -
بلقيس.كمال الدين
توفيقة يوسف. ق
حبيبة مسعود. ق
حليمة مييكي
حديزة.عبد الواسع
حنيفة سليمان
راضية إسماعيل
راضية.عبد الواسع
رحيمة.تاج الدين
زينة
مريم دنميرومو
مزيدة.أمين الله. ر٣٠٠٠
مؤمنة.عبد الكبير. ر٣٠٠٠
مطمئنة.أولاييوولا. ر٣٠٠٠
منيرة لقمان
عائشة.أبو بكر
عبيدة.سراج الدين. ر٣٠٠٠
فاطمة.أحمد
فاطمة دنميرمو. ر٢٠٠٠
فاطمة لقمان

📃 الأول التمهيد ب
أحمد.علي. ر٣٠٠٠
أحمد غاتا
إسحاق إسحاق.
حبيب الله.محمد
سلطان.غاتا
صالح.عبد الله
عبد الرحمان.يوسف
عبد السلام.عبد الحميد
عبد الله.عبد القادر
غبد الله.غاتا
عبد الله.لقمان. ر٣٠٠٠
عبد الله.إسحاق.ميماسى
عبد القادر.عبد الرحمان
عبد القادر.مصطفى
عيسى عيسى
مجتبى أحمد. ر٣٠٠٠
مصطفى.عبد القادر

حكيمة إبراهيم
رحمت الله.عبد الواسع
زينة أحمد
صبيرة.عثمان
فاطمة إبراهيم
عائشة.أحمد.إيشولى
عائشة.عبد الله
عليّة إبراهيم. ر٣٠٠٠

📃 الأول التمهيد ج

إبراهيم آدم
آدم إلياس. ق:م. رس٣٠٠٠. ر٢٠٠٠
أبو بكر.إبراهيم. ر٣٠٠٠
زيد أبندواكي. رس١٠٠٠
حسن مسعود. رس٣٠٠٠
حسين مسعود. رس٣٠٠٠
عبد الرحمان.كمال الدين
عبد القادر.جامع
عبد الله.إيشولى
عثمان.محمد
يوسف آدم

بلقيس إبراهيم
حنيفة عيسى. ر٣٠٠٠
حليمة عثمان
زينب.عبد القادر
سلامة.عبد السلام. ر٣٠٠٠. ق:ح
عائشة.يوسف.إبراهيم.
فاطمة إدريس.
مريم.عبد الواسع. ق:ح
هاجر أمودى.
يسرى.لقمان. ر٣٠٠٠

📃 الأول التمهيد د

أنس أولاييولى. ر٣٠٠٠
أويس أبندواكي. رس٣٠٠٠
عبد الخالق.معروف. ر٣٠٠٠
عبد القادر.ميماسى. ر٣٠٠٠
عبد المقسط.إسماعيل. ر٣٠٠٠
. . . . . . . . . . . . . . . . . . . . . . . . .

📃 الثاني التمهيد

إبراهيم.كمال الدين. ق:تج
سلمان أونييكون. ق:تج
نور الدين.إسماعيل. ق:تج
عبد الله.عبد الرحمان. ق:تج
عثمان.عبد القادر. ر٣٠٠٠.
يوسف.عبد الكريم. ق:تج
. . . . . . . . . . .

بلقيس أحمد. ق:ح
بلقيس أونيكون. ق:ح
حواء محمد. ق:ح
رحمة إسماعيل. ق:تج
فاطمة إبراهيم. ق:ح
مريم إيشولى. ق:ح
هاجر دنميرومو. ق:تج

📃 الأول الإبتدائي

إبراهيم.أبو بكر. ق:ج
إبراهيم أحمد. ق:م.
إبراهيم.عبد القادر. ق:م
أنس عثمان. ق:ج
بلال أبندواكي. رس٣٠٠٠
جلال الدين.يوسف. *
حذيفة بشير. ق. ق:م
حسن ميماسى. ر٣٠٠٠. ق:م
حسين ميماسى. ر٣٠٠٠. ق:م
خليفة الصالحين.عبد الكريم. ق. ق:ج
صالح بشير. ق. ق:م.
طه عيسى. ق:م. م.
عبد الباسط.مرتضى. ق:م.
عبد الجبار.إبراهيم. ق:م.
عبد الحميد.سعيد. ق:م.
عبد الرحمان.محمد الأول. ر٣٠٠٠. ق:م
عبد الرحمان.سليمان. ق:ج
عبد السلام.أمدى. ق:م
عبد السلام.أحمد. ق:ج
عبد القيوم.عبد الغني. ق:م.
عبد الله.مصطفى. ق:م
عبد الملك.إسماعيل. ق:م. م.
عبد المتين.يحيى. ر٣٠٠٠. ق:ج
عبد الملك.عبد الكبير. ر٣٠٠٠. ق:ج
عبد الوكيل.يوسف. ق:م
عثمان سليمان. ق:م
علي أحمد. ر٣٠٠٠. ق:م
غالب.عبد الكريم. ق. ق:م.
كمال الدين.يوسف. ق. ق:ج
محمد سليمان. ق:ج
محمد عثمان. ق:م.
محمد ناصر.عبد القادر. ق:م.
منصور بللوا. ق:ج
مصطفى أحمد. ر٣٠٠٠. ق:م.
. . . . . . . . . . . . . . . . . . . . . . . .
توفيقة.عبد الأوّل. ق. ق:ح
حسنة عثمان. ق:ح
حسينة عثمان. ق:ح
حليمة.عبد الله. ق:أ
رقية حسن. ق:ح
ريحانة سليمان. ق:ح
زينب يوسف. رس٣٠٠٠. ق:أ
سلامة قاسم. ق:أ
عائشة.عبد الأوّل. ق. ق:ح
عائشة.عبد القادر. ر٣٠٠٠. ق:أ
عائشة عيسى. ر٢٠٠٠. ق:أ
فاطمة.إسحق.ميماسى. ق:ح
فردوس أولاييوولى. ر٣٠٠٠. ق:أ
مريم.عبد القادر. ر٣٠٠٠. ق:أ
مريم.عبد الكبير. ر٣٠٠٠. ق:أ
مريم موسى. ر٣٠٠٠. ق:أ
ميمونة.عبد القادر. ق:ح
مؤمنة.أبو بكر. ق:أ.
نجيبة يوسف. ق. ق:أ.

📃 الثاني الإبتدائي

حمزة.محمد الأول. ر٣٠٠٠
عبد الله.سليمان.
عبد العظيم.إسماعيل. ر٣٠٠٠
محمد يونس.

أسماء جامع.
رحيمة أبندواكي. رس٣٠٠٠
رقيبة يحيى. ر٣٠٠٠
فريدة إبراهيم. ر٣٠٠٠
مريم جمعة.
مريم سليمان.
. . . . . . . . . . . . . . . . . . . . . . . . . .

📃 الأول الإعدادي

عبد الرحمان.عيسى. رس١٠٠٠
. . . . . . . . . . . . . . . . . . . . . . . . . .

📃 الثاني الإعدادي

عبد الحيّ.مصطفى. رس٣٠٠٠
عبد السلام.عيسى. رس٣٠٠٠
محمد مصطفى. رس٣٠٠٠.
. . . . . . . . . . . . . . . . . . . . . . . . .

زينب بشير. ق
صفي الله.عبد الغني. ق `;
